IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
/**
  ******************************************************************************
  * @file    xpd_adc.c
  * @author  Benedek Kupper
  * @version V0.1
  * @date    2016-02-04
  * @brief   STM32 eXtensible Peripheral Drivers Analog Digital Converter Module
  *
  *  This file is part of STM32_XPD.
  *
  *  STM32_XPD is free software: you can redistribute it and/or modify
  *  it under the terms of the GNU General Public License as published by
  *  the Free Software Foundation, either version 3 of the License, or
  *  (at your option) any later version.
  *
  *  STM32_XPD is distributed in the hope that it will be useful,
  *  but WITHOUT ANY WARRANTY; without even the implied warranty of
  *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  *  GNU General Public License for more details.
  *
  *  You should have received a copy of the GNU General Public License
  *  along with STM32_XPD.  If not, see <http://www.gnu.org/licenses/>.
  */

#include "xpd_adc.h"
#include "xpd_rcc.h"
#include "xpd_utils.h"

#if defined(USE_XPD_ADC)

/** @addtogroup ADC
 * @{ */

/** @addtogroup ADC_Core
 * @{ */

#define ADC_STAB_DELAY_US           10
#define ADC_TEMPSENSOR_DELAY_US     120
#define ADC_CALIBRATION_TIMEOUT     10
#define ADC_CONVERSION_TIME_MAX_CPU_CYCLES ((uint32_t) 156928)
#define ADC_STOP_CONVERSION_TIMEOUT 5

#define ADC_STARTCTRL           (ADC_CR_ADSTART | ADC_CR_JADSTART)
#define ADC_STOPCTRL            (ADC_CR_ADSTP | ADC_CR_JADSTP)
#define ADC_ENDFLAG_SEQUENCE    (ADC_IER_EOSIE | ADC_IER_JEOSIE)
#define ADC_ENDFLAG_CONVERSION  (ADC_IER_EOCIE | ADC_IER_JEOCIE)

#define ADC_SQR_MASK            (ADC_SQR1_SQ1 >> ADC_SQR1_SQ1_Pos)
#define ADC_SQR_SIZE            (ADC_SQR1_SQ2_Pos - ADC_SQR1_SQ1_Pos)

#if (ADC_COUNT > 1)

#define ADC_PAIR(HANDLE) \
    ((ADC_TypeDef *)(((uint32_t)(HANDLE)->Inst) ^ 0x100))

#define ADC_MULTI_CFGR(HANDLE, DUAL)    \
    (((DUAL) == ADC_MULTIMODE_SINGE) || (IS_ADC_MULTIMODE_MASTER_INSTANCE((HANDLE)->Inst))) ? \
        (HANDLE)->Inst->CFGR.w : ADC_PAIR(HANDLE)->CFGR.w)

#else

#define ADC_PAIR(HANDLE) NULL

#define ADC_MULTI_CFGR(HANDLE, DUAL)    \
    ((HANDLE)->Inst->CFGR.w)

#endif

#if (ADC_COUNT > 1)
static volatile uint8_t adc_users[] = {
        0
};

static void adc_clockCtrl(ADC_HandleType * hadc, FunctionalState ClockState)
{
    uint8_t adcx = ADC_INDEX(hadc);
    uint8_t index = 0;

    if (ClockState == DISABLE)
    {
        CLEAR_BIT(adc_users[index], 1 << adcx);
    }
    else
    {
        SET_BIT(adc_users[index], 1 << adcx);
    }

    XPD_ADC_ClockCtrl((adc_users[index] > 0) ? ENABLE : DISABLE);
}
#else
#define adc_clockCtrl(HANDLE, STATE)    (XPD_ADC_ClockCtrl(STATE))
#endif

__STATIC_INLINE uint32_t adc_getMultiCfgr(ADC_HandleType * hadc, uint32_t dual)
{
    uint32_t cfgr;
    /* Get relevant register CFGR in ADC instance of ADC master or slave
     * in function of multimode state (for devices with multimode available). */
    if (    (dual == ADC_MULTIMODE_SINGE)
         || (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Inst)))
    {
        cfgr = hadc->Inst->CFGR.w;
    }
    else
    {
        cfgr = ADC_PAIR(hadc)->CFGR.w;
    }
    return cfgr;
}

static void adc_dmaConversionRedirect(void *hdma)
{
    ADC_HandleType* hadc = (ADC_HandleType*) ((DMA_HandleType*) hdma)->Owner;

    XPD_SAFE_CALLBACK(hadc->Callbacks.ConvComplete, hadc);
}

#ifdef USE_XPD_DMA_ERROR_DETECT
static void adc_dmaErrorRedirect(void *hdma)
{
    ADC_HandleType* hadc = (ADC_HandleType*) ((DMA_HandleType*) hdma)->Owner;

    XPD_SAFE_CALLBACK(hadc->Callbacks.Error, hadc);
}
#endif

/* Enables the peripheral */
static boolean_t adcx_enable(ADC_TypeDef * ADCx)
{
    /* Requirements:
     * ADCAL, ADSTP, JADSTP, ADSTART, JADSTART, ADDIS, ADEN = 0 */
    boolean_t success = (0 == (ADCx->CR.w & (ADC_CR_ADEN | ADC_STARTCTRL
            | ADC_STOPCTRL | ADC_CR_ADCAL | ADC_CR_ADDIS)));
    if (success)
    {
        SET_BIT(ADCx->CR.w, ADC_CR_ADEN);
    }
    return success;
}

/* Disables the peripheral */
static void adcx_disable(ADC_TypeDef * ADCx)
{
    /* Requirements:
     * ADEN = 1, ADSTART, JADSTART = 0 */
    if (ADC_CR_ADEN == (ADCx->CR.w & (ADC_CR_ADEN | ADC_STARTCTRL)))
    {
        SET_BIT(ADCx->CR.w, ADC_CR_ADDIS);
        SET_BIT(ADCx->ISR.w, ADC_ISR_EOSMP | ADC_ISR_ADRDY);
    }
}

/* Sets the sample time for a channel configuration */
static void adc_sampleTimeConfig(ADC_HandleType * hadc, const ADC_ChannelInitType * Channel)
{
    uint32_t regoffset = 0, number = Channel->Number;

    /* Channel sampling time configuration */
    if (number > 10)
    {
        regoffset = 1;
        number -= 10;
    }
    number *= 3;

    /* set the sample time */
    MODIFY_REG((&hadc->Inst->SMPR1.w)[regoffset],
            ADC_SMPR1_SMP0 << number, Channel->SampleTime << number);
}

/* Sets the oversampling configuration of the ADC */
static void adc_oversamplingConfig(ADC_HandleType * hadc, const ADC_OversamplingType * Config)
{
    hadc->Inst->CFGR2.b.OVSS  = Config->RightShift;
    hadc->Inst->CFGR2.b.OVSR  = Config->Ratio;
    hadc->Inst->CFGR2.b.ROVSM = Config->RestartOnInject;
    hadc->Inst->CFGR2.b.TROVS = Config->DiscontinuousMode;
}

/* Enables an internal channel for conversion */
static void adc_initInternalChannel(ADC_HandleType * hadc, uint8_t Channel)
{
    uint32_t chbit = 0;

    switch (Channel)
    {
        case ADC1_VBAT_CHANNEL:
            /* enable the VBAT input */
#if (ADC_COUNT > 1)
            if (hadc->Inst != ADC2)
#endif
            { chbit = ADC_CCR_VBATEN; }
            break;

        case ADC1_VREFINT_CHANNEL:
#if (ADC_COUNT > 1)
            if (hadc->Inst == ADC1)
#endif
            /* enable the VREF input */
            { chbit = ADC_CCR_VREFEN; }
            break;

        case ADC1_TEMPSENSOR_CHANNEL:
            /* enable the TS input */
#if (ADC_COUNT > 1)
            if (hadc->Inst != ADC2)
#endif
            { chbit = ADC_CCR_TSEN; }
            break;

        default:
            break;
    }

    /* Check if setting is valid */
    if (((chbit != 0) && ((ADC_COMMON(hadc)->CCR.w & chbit) == 0))
        /* Software is allowed to change common parameters only when all ADCs
         * of the common group are disabled */
        &&  (ADC_REG_BIT(hadc, CR, ADEN) == 0)
#if (ADC_COUNT > 1)
         && (ADC_PAIR(hadc)->CR.b.ADEN == 0)
#endif
             )
    {
        SET_BIT(ADC_COMMON(hadc)->CCR.w, chbit);

