IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
        if (Channel == ADC1_TEMPSENSOR_CHANNEL)
        {
            /* wait temperature sensor stabilization */
            XPD_Delay_us(ADC_TEMPSENSOR_DELAY_US);
        }
    }
}

/* Stops the further conversions of the selected types */
static void adc_stopConversion(ADC_HandleType * hadc, uint32_t convFlag)
{
    uint32_t timeout = ADC_STOP_CONVERSION_TIMEOUT;

    /* Verification if ADC is not already stopped */
    if ((hadc->Inst->CR.w & ADC_STARTCTRL) != 0)
    {
        /* In auto-injection mode, regular group stop ADC_CR_ADSTP is used (not 
         * injected group stop ADC_CR_JADSTP) */
        if ((hadc->Inst->CFGR.w & (ADC_CFGR_JAUTO | ADC_CFGR_CONT | ADC_CFGR_AUTDLY))
                               == (ADC_CFGR_JAUTO | ADC_CFGR_CONT | ADC_CFGR_AUTDLY))
        {
            uint32_t counter;

            /* Use stop of regular group */
            convFlag = ADC_CR_ADSTART;

            /* Wait until JEOS=1 (maximum Timeout: 4 injected conversions) */
            for (counter = 0; counter < (ADC_CONVERSION_TIME_MAX_CPU_CYCLES * 4); counter++)
            {
                if (XPD_ADC_GetFlag(hadc, JEOS) == 0)
                {
                    break;
                }
            }

            /* Clear JEOS */
            XPD_ADC_ClearFlag(hadc, JEOS);
        }

        /* Stop potential conversion on going on regular group */
        if (convFlag != ADC_CR_JADSTART)
        {
            /* Software is allowed to set ADSTP only when ADSTART=1 and ADDIS=0 */
            if ((hadc->Inst->CR.w & (ADC_CR_ADSTART | ADC_CR_ADDIS)) == ADC_CR_ADSTART)
            {
                /* Stop conversions on regular group */
                ADC_REG_BIT(hadc, CR, ADSTP) = 1;
            }
        }

        /* Stop potential conversion on going on injected group */
        if (convFlag != ADC_CR_ADSTART)
        {
            /* Software is allowed to set JADSTP only when JADSTART=1 and ADDIS=0 */
            if ((hadc->Inst->CR.w & (ADC_CR_JADSTART | ADC_CR_ADDIS)) == ADC_CR_JADSTART)
            {
                /* Stop conversions on injected group */
                ADC_REG_BIT(hadc, CR, JADSTP) = 1;
            }
        }

        /* Wait for conversion effectively stopped */
        XPD_WaitForMatch(&hadc->Inst->CR.w, convFlag, 0, &timeout);
    }
}

/* Attempts to set the offset configuration of the input channel list */
static void adc_offsetConfig(ADC_HandleType * hadc, const ADC_ChannelInitType * Channels,
        uint8_t ChannelCount)
{
    union {
        struct {
            __IO uint32_t OFFSET : 12;
                 uint32_t __RESERVED0 : 14;
            __IO uint32_t OFFSET_CH : 5;
            __IO uint32_t OFFSET_EN : 1;
        } b;
        __IO uint32_t w;
    } *pOFR;
    uint32_t channels = 0, offsetNeeds = 0, i;

    /* Collect offset related information from list */
    for (i = 0; i < ChannelCount; i++)
    {
        SET_BIT(channels, Channels[i].Number);
        if (Channels[i].Offset > 0)
        {
            SET_BIT(offsetNeeds, Channels[i].Number);
        }
    }

    /* If there are channels that don't need offset, but are previously configured */
    channels = hadc->OffsetUsage & channels & (~offsetNeeds);
    if (channels != 0)
    {
        /* Find the channels in the offsets, clear config */
        for (pOFR = (void*)&hadc->Inst->OFR1.w;
                ((uint32_t)pOFR) <= ((uint32_t)&hadc->Inst->OFR4.w);
                pOFR++)
        {
            i = 1 << pOFR->b.OFFSET_CH;
            if ((channels & i) != 0)
            {
                pOFR->w = 0;
                CLEAR_BIT(hadc->OffsetUsage, i);
            }
        }
    }
    /* Iterate until all desired offsets are set */
    for (i = 0; (hadc->OffsetUsage != offsetNeeds) && (i < ChannelCount); i++)
    {
        /* If the current channel needs an offset */
        if (Channels[i].Offset > 0)
        {
            /* For the channels that are missing offset */
            for (pOFR = (void*)&hadc->Inst->OFR1.w;
                    ((uint32_t)pOFR) <= ((uint32_t)&hadc->Inst->OFR4.w);
                    pOFR++)
            {
                /* If the offset register is disabled, or already used by this channel */
                if ((pOFR->w == 0) || ((offsetNeeds & (1 << pOFR->b.OFFSET_CH)) != 0))
                {
                    pOFR->b.OFFSET    = Channels[i].Offset;
                    pOFR->b.OFFSET_CH = Channels[i].Number;
                    pOFR->b.OFFSET_EN = 1;
                    SET_BIT(hadc->OffsetUsage, Channels[i].Number);
                }
            }
        }
    }
}

/** @addtogroup ADC_Core_Exported_Functions
 * @{ */

/**
 * @brief Initializes the ADC peripheral using the setup configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Config: pointer to ADC setup configuration
 * @return ERROR if input is incorrect, OK if success
 */
XPD_ReturnType XPD_ADC_Init(ADC_HandleType * hadc, const ADC_InitType * Config)
{
    XPD_ReturnType result = XPD_ERROR;

    /* enable clock */
    adc_clockCtrl(hadc, ENABLE);

    /* Initialize ADC API internal variables */
    hadc->InjectedContextQueue = 0;
    hadc->ConversionCount = 0;
    hadc->OffsetUsage = 0;

    /* Set used EndFlag */
    if (Config->EndFlagSelection == ADC_EOC_SEQUENCE)
    {
        hadc->EndFlagSelection = ADC_ENDFLAG_SEQUENCE;
    }
    else
    {
        hadc->EndFlagSelection = ADC_ENDFLAG_CONVERSION;
    }

    /* Exit deep power down mode */
    ADC_REG_BIT(hadc,CR,DEEPPWD) = 0;

    /* Enable voltage regulator (if disabled at this step) */
    if (hadc->Inst->CR.b.ADVREGEN != 1)
    {
        /* ADC voltage regulator enable sequence */
#ifdef ADC_CR_ADVREGEN_1
        hadc->Inst->CR.b.ADVREGEN = 0;
#endif
        hadc->Inst->CR.b.ADVREGEN = 1;

        /* Delay for ADC stabilization time */
        XPD_Delay_us(ADC_STAB_DELAY_US);
    }

    /* ADC regular conversion stopped */
    if (ADC_REG_BIT(hadc, CR, ADSTART) == 0)
    {
        ADC_REG_BIT(hadc, CFGR, CONT)  = Config->ContinuousMode;
        ADC_REG_BIT(hadc, CFGR, ALIGN) = Config->LeftAlignment;
        hadc->Inst->CFGR.b.RES         = Config->Resolution;

        /* external trigger configuration */
        if(Config->Trigger.Source == ADC_TRIGGER_SOFTWARE)
        {
            /* reset the external trigger */
            CLEAR_BIT(hadc->Inst->CFGR.w, ADC_CFGR_EXTSEL | ADC_CFGR_EXTEN);
        }
        else
        {
            /* select external trigger and polarity to start conversion */
            hadc->Inst->CFGR.b.EXTSEL = Config->Trigger.Source;
            hadc->Inst->CFGR.b.EXTEN  = Config->Trigger.Edge;
        }

        /* Enable discontinuous mode only if continuous mode is disabled */
        if ((Config->DiscontinuousCount != 0) && (Config->ContinuousMode == DISABLE))
        {
            ADC_REG_BIT(hadc, CFGR, DISCEN) = 1;
            hadc->Inst->CFGR.b.DISCNUM = Config->DiscontinuousCount - 1;
        }
        else
        {
            CLEAR_BIT(hadc->Inst->CFGR.w, ADC_CFGR_DISCEN | ADC_CFGR_DISCNUM);
        }

        /* No injected or regular conversion ongoing */
        if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            ADC_REG_BIT(hadc, CFGR, AUTDLY) = Config->LPAutoWait;
            ADC_REG_BIT(hadc, CFGR, DMACFG) = Config->ContinuousDMARequests;
#ifdef ADC_CFGR_DFSDMCFG
            ADC_REG_BIT(hadc, CFGR,DFSDMCFG)= Config->DirectToDFSDM;
#endif

            /* Set oversampling mode configuration */
            if (Config->Oversampling.State == ENABLE)
            {
                adc_oversamplingConfig(hadc, &Config->Oversampling);
            }
            ADC_REG_BIT(hadc, CFGR2, ROVSE) = Config->Oversampling.State;
        }

        /* Set conversion count as flag when scan mode is selected */
        hadc->ConversionCount = Config->ScanMode & 1;

