IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
        result = XPD_OK;
    }

    /* dependencies initialization */
    XPD_SAFE_CALLBACK(hadc->Callbacks.DepInit, hadc);

    return result;
}

/**
 * @brief Deinitializes the ADC peripheral.
 * @param hadc: pointer to the ADC handle structure
 * @return ERROR if input is incorrect, OK if success
 */
XPD_ReturnType XPD_ADC_Deinit(ADC_HandleType * hadc)
{
    /* Stop potential conversion on going, on regular and injected groups */
    adc_stopConversion(hadc, ADC_STARTCTRL);

    /* Enable injected queue sequencer after injected conversion stop */
    ADC_REG_BIT(hadc, CFGR, JQM) = 1;

    /* Disable the ADC peripheral */
    adcx_disable(hadc->Inst);

    /* Reset register IER */
    hadc->Inst->IER.w = 0;

    /* Reset register ISR */
    hadc->Inst->ISR.w = ~0;

    /* Reset OFR registers */
    hadc->Inst->OFR1.w = 0;
    hadc->Inst->OFR2.w = 0;
    hadc->Inst->OFR3.w = 0;
    hadc->Inst->OFR4.w = 0;

    /* Disable voltage regulator */
    CLEAR_BIT(hadc->Inst->CR.w, ADC_CR_ADVREGEN | ADC_CR_ADCALDIF);
#ifdef ADC_CR_ADVREGEN_1
    SET_BIT(hadc->Inst->CR.w, ADC_CR_ADVREGEN_1);
#endif

    /* Reset register CFGR */
    hadc->Inst->CFGR.w = 0;
    hadc->Inst->CFGR2.w = 0;

    /* Deinitialize peripheral dependencies */
    XPD_SAFE_CALLBACK(hadc->Callbacks.DepDeinit, hadc);

    /* disable clock */
    adc_clockCtrl(hadc, DISABLE);

    return XPD_OK;
}

/**
 * @brief Initializes the regular ADC channels for conversion using the setup configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Channels: ADC regular channel configuration array pointer
 * @param ChannelCount: number of channels to configure
 */
void XPD_ADC_ChannelConfig(ADC_HandleType * hadc, const ADC_ChannelInitType * Channels, uint8_t ChannelCount)
{
    /* No regular conversion ongoing */
    if (ADC_REG_BIT(hadc, CR, ADSTART) == 0)
    {
        uint8_t i;

        /* Sequencer configuration */
        for (i = 0; (i < ChannelCount) && (i < 4); i++)
        {
            /* set the channel for the selected rank */
            uint32_t choffset = ADC_SQR1_SQ1_Pos + (ADC_SQR_SIZE * i);

            MODIFY_REG(hadc->Inst->SQR1.w,
                    ADC_SQR_MASK << choffset, Channels[i].Number << choffset);
        }
        for (; (i < ChannelCount) && (i < 9); i++)
        {
            /* set the channel for the selected rank */
            uint32_t choffset = ADC_SQR_SIZE * (i - 4);

            MODIFY_REG(hadc->Inst->SQR2.w,
                    ADC_SQR_MASK << choffset, Channels[i].Number << choffset);
        }
        for (; (i < ChannelCount) && (i < 14); i++)
        {
            /* set the channel for the selected rank */
            uint32_t choffset = ADC_SQR_SIZE * (i - 9);

            MODIFY_REG(hadc->Inst->SQR3.w,
                    ADC_SQR_MASK << choffset, Channels[i].Number << choffset);
        }
        for (;  i < ChannelCount; i++)
        {
            /* set the channel for the selected rank */
            uint32_t choffset = ADC_SQR_SIZE * (i - 14);

            MODIFY_REG(hadc->Inst->SQR4.w,
                    ADC_SQR_MASK << choffset, Channels[i].Number << choffset);
        }

        /* No injected conversion ongoing */
        if (ADC_REG_BIT(hadc, CR, JADSTART) == 0)
        {
            /* Channel sampling time configuration */
            for (i = 0; i < ChannelCount; i++)
            {
                /* Sample time configuration */
                adc_sampleTimeConfig(hadc, &Channels[i]);
            }

            /* Set offsets configuration */
            adc_offsetConfig(hadc, Channels, ChannelCount);
        }

        /* ADC disabled */
        if (ADC_REG_BIT(hadc, CR, ADEN) == 0)
        {
            /* Channel sampling time configuration */
            for (i = 0; i < ChannelCount; i++)
            {
                /* Internal channel configuration (if applicable) */
                adc_initInternalChannel(hadc, Channels[i].Number);

                /* Configuration of differential mode */
                if (Channels[i].Differential == ENABLE)
                {
                    ADC_ChannelInitType diffPair = Channels[i];

                    /* Enable differential mode */
                    SET_BIT(hadc->Inst->DIFSEL.w, 1 << Channels[i].Number);

                    /* Pair channel sampling time configuration */
                    diffPair.Number++;
                    adc_sampleTimeConfig(hadc, &diffPair);
                }
                else
                {
                    /* Disable differential mode (default mode: single-ended) */
                    CLEAR_BIT(hadc->Inst->DIFSEL.w, 1 << Channels[i].Number);
                }
            }
        }

        /* Init() sets this variable as flag to indicate ScanMode */
        if (hadc->ConversionCount > 0)
        {
            hadc->ConversionCount = ChannelCount;

            /* Set number of ranks in regular group sequencer */
            hadc->Inst->SQR1.b.L = hadc->ConversionCount - 1;
        }
        else
        {
            hadc->Inst->SQR1.b.L = 0;
        }
    }
}

/**
 * @brief Enables the ADC peripheral and starts conversion if the trigger is software.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Start(ADC_HandleType * hadc)
{
    /* Success if not started */
    if (ADC_REG_BIT(hadc, CR, ADSTART) == 0)
    {
        /* ADC turn ON */
        if (adcx_enable(hadc->Inst))
        {
            /* Wait until ADRDY flag is set ( < 1us) */
            uint32_t timeout = 1;
            XPD_WaitForMatch(&hadc->Inst->ISR.w, ADC_ISR_ADRDY, ADC_ISR_ADRDY, &timeout);
        }

        /* clear regular group conversion flag and overrun flag */
        SET_BIT(hadc->Inst->ISR.w, ADC_ISR_EOC | ADC_ISR_EOS | ADC_ISR_OVR);

        /* if ADC is either not in multimode, or the multimode master,
         * enable software conversion of regular channels */
        if (    (ADC_COMMON(hadc)->CCR.b.DUAL == ADC_MULTIMODE_SINGE)
             || (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Inst)))
        {
            ADC_REG_BIT(hadc, CR, ADSTART) = 1;
        }

