IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
#if defined(USE_XPD_ADC_ERROR_DETECT) || defined(USE_XPD_DMA_ERROR_DETECT)
        hadc->Errors = ADC_ERROR_NONE;
#endif
    }
}

/**
 * @brief Stops the ADC peripheral.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Stop(ADC_HandleType * hadc)
{
    uint32_t timeout = 1;

    /* 1. Stop potential conversion on going, on regular and injected groups */
    adc_stopConversion(hadc, ADC_STARTCTRL);

    adcx_disable(hadc->Inst);

    XPD_WaitForMatch(&hadc->Inst->ISR.w, ADC_ISR_ADRDY, 0, &timeout);
}

/**
 * @brief Polls the status of the ADC operation(s).
 * @param hadc: pointer to the ADC handle structure
 * @param Operation: the type of operation to check
 * @param Timeout: the timeout in ms for the polling.
 * @return ERROR if there was an input error, TIMEOUT if timed out, OK if successful
 */
XPD_ReturnType XPD_ADC_PollStatus(ADC_HandleType * hadc, ADC_OperationType Operation, uint32_t Timeout)
{
    XPD_ReturnType result = XPD_OK;

    if ((Operation == ADC_OPERATION_CONVERSION)
            && ((hadc->EndFlagSelection & ADC_IER_EOS) != 0))
    {
        Operation = ADC_ISR_EOS;
    }
    else if ((Operation == ADC_OPERATION_INJCONVERSION)
            && ((hadc->EndFlagSelection & ADC_IER_JEOS) != 0))
    {
        Operation = ADC_ISR_JEOS;
    }

    /* Polling for single conversion is not allowed when DMA is used,
     * and EOC is raised on end of single conversion */
    if (Operation == ADC_OPERATION_CONVERSION)
    {
        /* If multimode used, check common DMA config, otherwise dedicated DMA config */
        if (ADC_COMMON_REG_BIT(hadc, CCR, DUAL) == 0)
        {
            if (ADC_REG_BIT(hadc, CFGR, DMAEN) == 1)
            { result = XPD_ERROR; }
        }
        else
        {
            if (ADC_COMMON_REG_BIT(hadc, CCR, MDMA) == 1)
            { result = XPD_ERROR; }
        }
    }

    if (result == XPD_OK)
    {
        result = XPD_WaitForMatch(&hadc->Inst->ISR.w, Operation, Operation, &Timeout);

        /* Clear end of conversion flag of regular group if low power feature
         * "LowPowerAutoWait " is disabled, to not interfere with this feature
         * until data register is read. */
        if ((result == XPD_OK) && ((Operation & (ADC_ISR_EOC | ADC_ISR_EOS)) != 0)
             && (ADC_REG_BIT(hadc, CFGR, AUTDLY) == 0))
        {
            SET_BIT(hadc->Inst->ISR.w, Operation);
        }
    }
    return result;
}

/**
 * @brief Enables the ADC peripheral and interrupts, and starts conversion
 *        if the trigger is software.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Start_IT(ADC_HandleType * hadc)
{
    /* Choose interrupt source based on EOC config */
    uint32_t its = hadc->EndFlagSelection;

#ifdef USE_XPD_ADC_ERROR_DETECT
    /* ADC overrun and end of conversion interrupt for regular group */
    its |= ADC_IER_OVRIE;
#endif

    MODIFY_REG(hadc->Inst->IER.w, (ADC_IER_EOCIE | ADC_IER_EOSIE | ADC_IER_OVRIE), its);

    XPD_ADC_Start(hadc);
}

/**
 * @brief Stops the ADC peripheral and disables interrupts.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Stop_IT(ADC_HandleType * hadc)
{
    XPD_ADC_Stop(hadc);

    /* ADC end of conversion interrupt for regular and injected group */
    CLEAR_BIT(hadc->Inst->IER.w, hadc->EndFlagSelection | ADC_IER_OVRIE);
}

/**
 * @brief ADC interrupt handler that provides handle callbacks.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_IRQHandler(ADC_HandleType * hadc)
{
    uint32_t isr = hadc->Inst->ISR.w;
    uint32_t ier = hadc->Inst->IER.w;
    uint32_t dual = ADC_COMMON(hadc)->CCR.b.DUAL;

    /* End of conversion flag for regular channels */
    if (    ((isr & (ADC_ISR_EOC | ADC_ISR_EOS)) != 0)
         && ((ier & (ADC_IER_EOCIE | ADC_IER_EOSIE)) != 0))
    {
        uint32_t cfgr = adc_getMultiCfgr(hadc, dual);

        /* If the conversion is not continuous / external triggered */
        if ((cfgr & (ADC_CFGR_CONT | ADC_CFGR_EXTEN)) == 0)
        {
            /* End of sequence */
            if (((isr & ADC_ISR_EOS) != 0) && (ADC_REG_BIT(hadc, CR, ADSTART) == 0))
            {
                /* Disable the ADC end of conversion interrupt for regular group */
                CLEAR_BIT(hadc->Inst->IER.w, ADC_IER_EOCIE | ADC_IER_EOSIE);
            }
        }

        /* Clear the ADC flag for regular end of conversion */
        SET_BIT(hadc->Inst->ISR.w, ADC_ISR_EOC | ADC_ISR_EOS);

        /* Conversion complete callback */
        XPD_SAFE_CALLBACK(hadc->Callbacks.ConvComplete, hadc);
    }

    /* End of conversion flag for injected channels */
    if (    ((isr & (ADC_ISR_JEOC | ADC_ISR_JEOS)) != 0)
         && ((ier & (ADC_IER_JEOCIE | ADC_IER_JEOSIE)) != 0))
    {
        uint32_t cfgr = adc_getMultiCfgr(hadc, dual);

        /* Injected conversion is not continuous or not automatic,
         * and software triggered */
        if (    (hadc->Inst->JSQR.b.JEXTEN == 0)
             || (    ((cfgr & ADC_CFGR_CONT) == 0)
                  && (hadc->Inst->CFGR.b.EXTEN == 0)
                  && (hadc->Inst->CFGR.b.JAUTO == 0)))
        {
            /* End of sequence */
            if ((isr & ADC_ISR_JEOS) != 0)
            {
                if (    (dual == ADC_MULTIMODE_SINGE)
                     || (dual == ADC_MULTIMODE_DUAL_REGSIMULT)
                     || (dual == ADC_MULTIMODE_DUAL_INTERLEAVED)
                     || (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Inst)))
                {
                    cfgr = hadc->Inst->CFGR.w;
                }
                else
                {
                    cfgr = ADC_PAIR(hadc)->CFGR.w;
                }

                if ((cfgr & ADC_CFGR_JQM) == 0)
                {
                    if (ADC_REG_BIT(hadc, CR, JADSTART) == 0)
                    {
                        /* disable the ADC end of conversion interrupt
                         * for injected group */
                        CLEAR_BIT(hadc->Inst->IER.w, ADC_IER_JEOC | ADC_IER_JEOS);
                    }
                }
            }
        }
        /* clear the ADC flag for injected end of conversion */
        SET_BIT(hadc->Inst->ISR.w, ADC_ISR_JEOC | ADC_ISR_JEOS);

        /* injected conversion complete callback */
        XPD_SAFE_CALLBACK(hadc->Callbacks.InjConvComplete, hadc);
    }

    /* Check analog watchdog flag */
    if (    ((isr & ADC_ISR_AWD1) != 0)
         && ((ier & ADC_IER_AWD1IE) != 0))
    {
        hadc->ActiveWatchdog = 1;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(hadc->Callbacks.Watchdog, hadc);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        XPD_ADC_ClearFlag(hadc, AWD1);
    }
    if (    ((isr & ADC_ISR_AWD2) != 0)
         && ((ier & ADC_IER_AWD2IE) != 0))
    {
        hadc->ActiveWatchdog = 2;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(hadc->Callbacks.Watchdog, hadc);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        XPD_ADC_ClearFlag(hadc, AWD2);
    }
    if (    ((isr & ADC_ISR_AWD3) != 0)
         && ((ier & ADC_IER_AWD3IE) != 0))
    {
        hadc->ActiveWatchdog = 3;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(hadc->Callbacks.Watchdog, hadc);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        XPD_ADC_ClearFlag(hadc, AWD3);
    }

#ifdef USE_XPD_ADC_ERROR_DETECT
    /* Check Overrun flag */
    if (    ((isr & ADC_ISR_OVR) != 0)
         && ((ier & ADC_IER_OVRIE) != 0))
    {
        /* Update error code */
        hadc->Errors |= ADC_ERROR_OVERRUN;

        /* Clear the Overrun flag */
        XPD_ADC_ClearFlag(hadc, OVR);
    }
    /* Check Injected Overrun flag */
    if (    ((isr & ADC_ISR_JQOVF) != 0)
         && ((ier & ADC_IER_JQOVFIE) != 0))
    {
        /* Update error code */
        hadc->Errors |= ADC_ERROR_JQOVF;

        /* Clear the Overrun flag */
        XPD_ADC_ClearFlag(hadc, JQOVF);
    }

