IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
    if (hadc->Errors != ADC_ERROR_NONE)
    {
        /* Error callback */
        XPD_SAFE_CALLBACK(hadc->Callbacks.Error, hadc);
    }
#endif
}

/**
 * @brief Sets up and enables a DMA transfer for the ADC regular conversions.
 * @param hadc: pointer to the ADC handle structure
 * @param Address: memory address to the conversion data storage
 * @return ERROR if the DMA is used by other peripheral, OK otherwise
 */
XPD_ReturnType XPD_ADC_Start_DMA(ADC_HandleType * hadc, void * Address)
{
    XPD_ReturnType result = XPD_ERROR;

    /* If multimode is used, multimode function shall be used */
    if (ADC_COMMON(hadc)->CCR.b.DUAL == ADC_MULTIMODE_SINGE)
    {
        /* Set up DMA for transfer */
        result = XPD_DMA_Start_IT(hadc->DMA.Conversion,
                (void *)&hadc->Inst->DR, Address, hadc->Inst->SQR1.b.L + 1);

        /* If the DMA is currently used, return with error */
        if (result == XPD_OK)
        {
            /* Set the callback owner */
            hadc->DMA.Conversion->Owner = hadc;

            /* Set the DMA transfer callbacks */
            hadc->DMA.Conversion->Callbacks.Complete     = adc_dmaConversionRedirect;
#ifdef USE_XPD_DMA_ERROR_DETECT
            hadc->DMA.Conversion->Callbacks.Error        = adc_dmaErrorRedirect;
#endif

#ifdef USE_XPD_ADC_ERROR_DETECT
            /* Enable ADC overrun interrupt */
            XPD_ADC_EnableIT(hadc, OVR);
#endif

            /* Enable ADC DMA mode */
            ADC_REG_BIT(hadc, CFGR, DMAEN) = 1;

            XPD_ADC_Start(hadc);
        }
    }

    return result;
}

/**
 * @brief Disables the ADC and its DMA transfer.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Stop_DMA(ADC_HandleType * hadc)
{
    /* Disable the Peripheral */
    XPD_ADC_Stop(hadc);

#ifdef USE_XPD_ADC_ERROR_DETECT
    /* Disable ADC overrun interrupt */
    XPD_ADC_DisableIT(hadc, OVR);
#endif

    /* Disable the selected ADC DMA mode */
    ADC_REG_BIT(hadc, CFGR, DMAEN) = 0;

    /* Disable the ADC DMA Stream */
    XPD_DMA_Stop_IT(hadc->DMA.Conversion);
}

/**
 * @brief Initializes the analog watchdog using the setup configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Channel: the ADC channel to monitor (only used when single channel monitoring is configured)
 * @param Config: pointer to analog watchdog setup configuration
 */
void XPD_ADC_WatchdogConfig(ADC_HandleType * hadc, uint8_t Channel, const ADC_WatchdogInitType * Config)
{
    /* No injected or regular conversion ongoing */
    if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        uint32_t scaling = hadc->Inst->CFGR.b.RES * 2;

        /* AWD1 */
        if (Config->Number == 1)
        {
            /* Set channels selection */
            MODIFY_REG(hadc->Inst->CFGR.w,
                    (ADC_CFGR_AWD1SGL | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1EN), Config->Mode);
            hadc->Inst->CFGR.b.AWD1CH = Channel;

            hadc->Inst->TR1.w = (Config->Threshold.High  << (16 + scaling))
                    | (Config->Threshold.Low  << scaling);

            XPD_ADC_ClearFlag(hadc, AWD1);

            /* Configure ADC Analog watchdog interrupt */
            XPD_ADC_EnableIT(hadc, AWD1);
        }
        else
        {
            uint32_t thr;
            /* Shift the threshold in function of the selected ADC resolution
             * have to be left-aligned on bit 7, the LSB (right bits) are set to 0 */
            if (4 < scaling)
            {
                thr = (Config->Threshold.High  << (20 - scaling))
                        | (Config->Threshold.Low  >> (scaling - 4));
            }
            else
            {
                thr = (Config->Threshold.High  << (20 - scaling))
                        | (Config->Threshold.Low  << (4 - scaling));
            }

            /* AWD2 */
            if (Config->Number == 2)
            {
                if (Config->Mode != ADC_WATCHDOG_NONE)
                {
                    /* Set the high and low thresholds */
                    hadc->Inst->TR2.w = thr;

                    /* All channels selection */
                    if ((Config->Mode & ADC_CFGR_AWD1SGL) == 0)
                    {
                        hadc->Inst->AWD2CR.w = ADC_AWD2CR_AWD2CH;
                    }
                    else
                    {
                        SET_BIT(hadc->Inst->AWD2CR.w, 1 << Channel);
                    }
                }
                else
                {
                    /* Disable watchdog */
                    hadc->Inst->TR2.w = 0;
                    hadc->Inst->AWD2CR.w = 0;
                }

                XPD_ADC_ClearFlag(hadc, AWD2);

                /* Configure ADC Analog watchdog interrupt */
                XPD_ADC_EnableIT(hadc, AWD2);
            }
            /* AWD3 */
            else
            {
                if (Config->Mode != ADC_WATCHDOG_NONE)
                {
                    /* Set the high and low thresholds */
                    hadc->Inst->TR3.w = thr;

                    /* All channels selection */
                    if ((Config->Mode & ADC_CFGR_AWD1SGL) == 0)
                    {
                        hadc->Inst->AWD3CR.w = ADC_AWD3CR_AWD3CH;
                    }
                    else
                    {
                        SET_BIT(hadc->Inst->AWD3CR.w, 1 << Channel);
                    }
                }
                else
                {
                    /* Disable watchdog */
                    hadc->Inst->TR3.w = 0;
                    hadc->Inst->AWD3CR.w = 0;
                }

                XPD_ADC_ClearFlag(hadc, AWD3);

                /* Configure ADC Analog watchdog interrupt */
                XPD_ADC_EnableIT(hadc, AWD3);
            }
        }
    }
}

/**
 * @brief Returns the currently active analog watchdog.
 * @param hadc: pointer to the ADC handle structure
 * @return The watchdog number if an active watchdog triggered an interrupt, 0 otherwise
 */
uint8_t XPD_ADC_WatchdogStatus(ADC_HandleType * hadc)
{
    /* Update the active watchdog variable with current flag status */
    hadc->ActiveWatchdog *= hadc->Inst->ISR.w >> (hadc->ActiveWatchdog + ADC_ISR_AWD1_Pos - 1);
    return hadc->ActiveWatchdog;
}

/** @} */

/** @} */

/** @addtogroup ADC_Injected
 * @{ */

/** @defgroup ADC_Injected_Exported_Functions ADC Injected Exported Functions
 * @{ */

/**
 * @brief Initializes a injected ADC channel for conversion using the setup configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Config: pointer to ADC injected channel setup configuration
 */
void XPD_ADC_Injected_Init(ADC_HandleType * hadc, const ADC_Injected_InitType * Config)
{
    /* Save trigger configuration into context queue */
    if (Config->Trigger.InjSource != ADC_INJTRIGGER_SOFTWARE)
    {
        MODIFY_REG(hadc->InjectedContextQueue,
                ADC_JSQR_JEXTEN | ADC_JSQR_JEXTSEL,
                (Config->Trigger.InjSource << ADC_JSQR_JEXTSEL_Pos) |
                (Config->Trigger.Edge      << ADC_JSQR_JEXTEN_Pos));
    }
    else
    {
        CLEAR_BIT(hadc->InjectedContextQueue,
                ADC_JSQR_JEXTEN | ADC_JSQR_JEXTSEL);
    }

    /* Set configuration that is restricted to no ongoing injected conversions */
    if (ADC_REG_BIT(hadc, CR, JADSTART) == 0)
    {
        hadc->Inst->CFGR.b.JQM     = Config->ContextQueue;
        hadc->Inst->CFGR.b.JDISCEN = Config->DiscontinuousMode & (!Config->AutoInjection);

        /* Set configuration that is restricted to no ongoing conversions */
        if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            /* Auto-injection is triggered by end of regular group conversion,
             * external triggers are not allowed */
            {
                hadc->Inst->CFGR.b.JAUTO = Config->AutoInjection;
            }

            /* Set oversampling mode configuration */
            if (Config->Oversampling.State == ENABLE)
            {
                adc_oversamplingConfig(hadc, &Config->Oversampling);
            }
            ADC_REG_BIT(hadc, CFGR2, JOVSE) = Config->Oversampling.State;
        }
    }
}

/**
 * @brief Initializes the injected ADC channels for conversion using the setup configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Channels: ADC injected channel configuration array pointer
 * @param ChannelCount: number of channels to configure
 */
void XPD_ADC_Injected_ChannelConfig(ADC_HandleType * hadc, const ADC_ChannelInitType * Channels,
        uint8_t ChannelCount)
{
    uint8_t i;

    /* No ongoing conversions bound settings */
    if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        /* Channel sampling time configuration */
        for (i = 0; i < ChannelCount; i++)
        {
            /* Sample time configuration */
            adc_sampleTimeConfig(hadc, &Channels[i]);
        }

        /* Set offsets configuration */
        adc_offsetConfig(hadc, Channels, ChannelCount);

        /* ADC disabled */
        if (ADC_REG_BIT(hadc, CR, ADEN) == 0)
        {
            /* Channel sampling time configuration */
            for (i = 0; i < ChannelCount; i++)
            {
                /* Internal channel configuration (if applicable) */
                adc_initInternalChannel(hadc, Channels[i].Number);

