IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
                /* Configuration of differential mode */
                if (Channels[i].Differential == ENABLE)
                {
                    ADC_ChannelInitType diffPair = Channels[i];

                    /* Enable differential mode */
                    SET_BIT(hadc->Inst->DIFSEL.w, 1 << Channels[i].Number);

                    /* Pair channel sampling time configuration */
                    diffPair.Number++;
                    adc_sampleTimeConfig(hadc, &diffPair);
                }
                else
                {
                    /* Disable differential mode (default mode: single-ended) */
                    CLEAR_BIT(hadc->Inst->DIFSEL.w, 1 << Channels[i].Number);
                }
            }
        }
    }

    /* Assemble injected sequence */
    for (i = 0; i < ChannelCount; i++)
    {
        /* Channel configuration for a given rank */
        uint32_t choffset = ADC_JSQR_JSQ1_Pos + (ADC_SQR_SIZE * i);

        /* Set the SQx bits for the selected rank */
        MODIFY_REG(hadc->InjectedContextQueue,
                ADC_SQR_MASK << choffset, Channels[i].Number << choffset);
    }

    /* Set the injected sequence length */
    MODIFY_REG(hadc->InjectedContextQueue,
            ADC_JSQR_JL, (ChannelCount - 1) << ADC_JSQR_JL_Pos);

    /* Finally apply the injected setup to the register */
    hadc->Inst->JSQR.w = hadc->InjectedContextQueue;
}

/**
 * @brief Enables the ADC peripheral and starts injected conversion
 *        if the trigger is software.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Injected_Start(ADC_HandleType * hadc)
{
    uint32_t dual = ADC_COMMON(hadc)->CCR.b.DUAL;

    /* Check if ADC peripheral is disabled in order to enable it and wait during
     Tstab time the ADC's stabilization */
    if (ADC_REG_BIT(hadc,CR,JADSTART) == 0)
    {
        /* Enable the Peripheral */
        if (adcx_enable(hadc->Inst))
        {
            /* Delay for ADC stabilization time */
            XPD_Delay_us(ADC_STAB_DELAY_US);
        }
    }

    /* clear injected group conversion flag */
    SET_BIT(hadc->Inst->ISR.w, ADC_ISR_JEOC | ADC_ISR_JEOS | ADC_ISR_JQOVF);

    /* if no external trigger present and ADC is either not in multimode,
     * or the multimode master, enable software conversion of injected channels */
    if ((hadc->Inst->CFGR.b.JAUTO == 0) &&
        (   (dual == ADC_MULTIMODE_SINGE)
         || (dual == ADC_MULTIMODE_DUAL_REGSIMULT)
         || (dual == ADC_MULTIMODE_DUAL_INTERLEAVED)
         || (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Inst))))
    {
        ADC_REG_BIT(hadc,CR,JADSTART) = 1;
    }
}

/**
 * @brief Stop the conversion of injected channels by disabling ADC peripheral.
 * @note  If auto-injection is used, the conversion can only be stopped along with the regular group.
 * @note  In multimode configuration, the master ADC shall be stopped first.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Injected_Stop(ADC_HandleType * hadc)
{
    /* Stop conversion on injected group only */
    adc_stopConversion(hadc, ADC_CR_JADSTART);

    /* Disable ADC peripheral if injected conversions are effectively stopped */
    if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        adcx_disable(hadc->Inst);
    }
}

/**
 * @brief Enables the ADC peripheral and interrupts, and starts injected conversion
 *        if the trigger is software.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Injected_Start_IT(ADC_HandleType * hadc)
{
    uint32_t its = hadc->EndFlagSelection & (ADC_IER_JEOCIE | ADC_IER_JEOSIE);
    /* ADC overrun and end of conversion interrupt for regular group */
#ifdef USE_XPD_ADC_ERROR_DETECT
    its |= ADC_IER_JQOVFIE;
#endif
    SET_BIT(hadc->Inst->IER.w, its);

    XPD_ADC_Injected_Start(hadc);
}

/**
 * @brief Stop the conversion of injected channels by disabling ADC peripheral and interrupts.
 * @note  If auto-injection is used, the conversion can only be stopped along with the regular group.
 * @note  In multimode configuration, the master ADC shall be stopped first.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Injected_Stop_IT(ADC_HandleType * hadc)
{
    XPD_ADC_Injected_Stop(hadc);

    XPD_ADC_DisableIT(hadc, JEOC);
}

/** @} */

/** @} */

#ifdef ADC123_COMMON
/** @addtogroup ADC_MultiMode
 * @{ */

/** @defgroup ADC_MultiMode_Exported_Functions Multi ADC Mode Exported Functions
 * @{ */

/**
 * @brief Initializes a multi ADC configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Config: pointer to the multi ADC setup configuration
 */
void XPD_ADC_MultiMode_Config(ADC_HandleType * hadc, const ADC_MultiMode_InitType * Config)
{
    __IO uint32_t * pCR = &ADC_PAIR(hadc)->CR.w;
    ADC_Common_TypeDef *common = ADC_COMMON(hadc);

    /* Neither ADC should be running regular conversion */
    if (    ((hadc->Inst->CR.w & ADC_CR_ADSTART) == 0)
         && ((            *pCR & ADC_CR_ADSTART) == 0))
    {
        common->CCR.b.MDMA = Config->DMAAccessMode;
        common->CCR.b.DMACFG = hadc->Inst->CFGR.b.DMACFG;

        /* Neither ADC should be on */
        if (    ((hadc->Inst->CR.w & ADC_CR_ADEN) == 0)
             && ((            *pCR & ADC_CR_ADEN) == 0))
        {
            common->CCR.b.DUAL  = Config->Mode;
            common->CCR.b.DELAY = Config->InterSamplingDelay;
        }
    }
}

/**
 * @brief Sets up and enables a DMA transfer for the multi ADC regular conversions.
 * @param hadc: pointer to the ADC handle structure
 * @param Address: memory address to the conversion data storage
 * @return ERROR if the DMA is used by other peripheral, OK otherwise
 */
XPD_ReturnType XPD_ADC_MultiMode_Start_DMA(ADC_HandleType * hadc, void * Address)
{
    XPD_ReturnType result = XPD_ERROR;

    /* Perform ADC enable and conversion start if no conversion is on going
     * (check on ADC master only) */
    if ((ADC_REG_BIT(hadc,CR,ADSTART) == 0) && ((ADC_INDEX(hadc) & 1) == 0))
    {
        /* enable both ADCs */
        (void)adcx_enable(hadc->Inst);
        (void)adcx_enable(ADC_PAIR(hadc));

        /* Set up DMA for transfer */
        result = XPD_DMA_Start_IT(hadc->DMA.Conversion,
                (void *)&ADC_COMMON(hadc)->CDR.w, Address, hadc->Inst->SQR1.b.L + 1);

        /* If the DMA is currently used, return with error */
        if (result == XPD_OK)
        {
            /* Set the callback owner */
            hadc->DMA.Conversion->Owner = hadc;

            /* Set the DMA transfer callbacks */
            hadc->DMA.Conversion->Callbacks.Complete     = adc_dmaConversionRedirect;
#ifdef USE_XPD_DMA_ERROR_DETECT
            hadc->DMA.Conversion->Callbacks.Error        = adc_dmaErrorRedirect;
#endif

#ifdef USE_XPD_ADC_ERROR_DETECT
            /* Enable ADC overrun interrupt */
            XPD_ADC_EnableIT(hadc, OVR);
#endif

            /* Enable the ADC peripherals: master and slave
             * (in case if not already enabled previously) */
            ADC_PAIR(hadc)->CR.b.ADEN = 1;

