IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
            /* Enable ADC DMA mode */
            ADC_REG_BIT(hadc, CFGR, DMAEN) = 1;

            XPD_ADC_Start(hadc);
        }
    }

    return result;
}

/**
 * @brief Disables the ADC and the common DMA transfer.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_MultiMode_Stop_DMA(ADC_HandleType * hadc)
{
    ADC_TypeDef *pair = ADC_PAIR(hadc);
    uint32_t timeout = ADC_STOP_CONVERSION_TIMEOUT;

    XPD_ADC_Stop_DMA(hadc);

    /* Wait for effective finish of slave conversion */
    if (XPD_OK == XPD_WaitForMatch(&pair->CR.w, ADC_CR_ADSTART, 0, &timeout))
    {
        /* disable pair */
        adcx_disable(pair);
    }
}

/** @} */

/** @} */
#endif

/** @addtogroup ADC_Calibration
 * @{ */

/** @defgroup ADC_Calibration_Exported_Functions ADC Calibration Exported Functions
 * @{ */

XPD_ReturnType XPD_ADC_Calibrate(ADC_HandleType * hadc, boolean_t Differential)
{
    XPD_ReturnType result = XPD_ERROR;

    /* Calibration prerequisite: ADC must be disabled. */
    if (ADC_REG_BIT(hadc, CR, ADEN) == 0)
    {
        uint32_t timeout = ADC_CALIBRATION_TIMEOUT;

        /* Select calibration mode single ended or differential ended */
        ADC_REG_BIT(hadc, CR, ADCALDIF) = Differential;

        /* Start ADC calibration */
        ADC_REG_BIT(hadc, CR, ADCAL) = 1;

        result = XPD_WaitForDiff(&hadc->Inst->CR.w,
                ADC_CR_ADCAL, ADC_CR_ADCAL, &timeout);
    }
    return result;
}

/** @} */

/** @} */

/** @} */

#endif /* USE_XPD_ADC */
